# -----------------------------------------------------------------------------------
# 파일명       : ONNX_Transform.py
# 설명         : Image Segmentation(U-Net) 모델 경량화를 위한 ONNX 변환  
# 작성자       : 이민하
# 작성일       : 2026-04-10
# -----------------------------------------------------------------------------------
# >> 주요 기능
# - Image Segmentation 모델의 ONNX 변환
# - 기존 모델과의 성능 비교
#
# >> 성능 (Seed 7 고정)
#
# -----------------------------------------------------------------------------------


from XRaySegModules import SegmentationUNet, set_seed, load_model

